--[[
|-------------------------------------------------------------------------------------------------|
|   ######## ######## ########  ##     ## #### ##    ##    ###    ########  #######  ########     |
|      ##    ##       ##     ## ###   ###  ##  ###   ##   ## ##      ##    ##     ## ##     ##    |
|      ##    ##       ##     ## #### ####  ##  ####  ##  ##   ##     ##    ##     ## ##     ##    |
|      ##    ######   ########  ## ### ##  ##  ## ## ## ##     ##    ##    ##     ## ########     |
|      ##    ##       ##   ##   ##     ##  ##  ##  #### #########    ##    ##     ## ##   ##      |
|      ##    ##       ##    ##  ##     ##  ##  ##   ### ##     ##    ##    ##     ## ##    ##     |
|      ##    ######## ##     ## ##     ## #### ##    ## ##     ##    ##     #######  ##     ##    |
|-------------------------------------------------------------------------------------------------|
| This Project Powered by : Rahman Rahimi CopyRight 2016 Terminator Version 4.0 Anti Spam Cli Bot |
|-------------------------------------------------------------------------------------------------|
]]
do

function run(msg, matches)
  return [[ 
🔰ورژن:Terminator V4.0🔰
🔰یه ربات برنامه ریزی شده برپایه سید (هوشمند،سریع،قدرتمند)🔰
🔰مدل پردازنده:Intel(R) Core(TM) i7-6700 CPU @ 3.40GHz🔰
🔰تعداد هسته:2-1هسته🔰
🔰مقدار رم:4-2گیگ🔰
🔰هارد:200-140گیگ اس اس دی🔰
🔰محل سرور:آمریکا-آلمان🔰
🔰مدیریت تیم و توسعه دهنده: @Tr1_FRHT_Tr1🔰
🔰مديريت: @Tr2_FRHT_Tr2🔰 
🔰پشتیبان: @Tr3_FRHT_Tr3🔰   
🇮🇷🇮🇷🇮🇷🇮🇷🇮🇷🇮🇷🇮🇷🇮
☀️توضیح مختصر☀️:
یک ربات ساده و مخصوص مدیریت حرفه ای گروه
🇮🇷🇮🇷🇮🇷🇮🇷🇮🇷🇮🇷🇮🇷🇮
☀️☀️
ترمیناتور یک ربات دوزبانه است:ENG-PER
]]
end

return {
  description = "Shows bot version", 
  usage = "ver: Shows bot version",
  patterns = {
    "^ترمیناتور$",
    "^ورژن$",
        "^terminator$",
            "^version$",
    "^ver$",
        "^Ver$",
      "^Version$",
      "^Terminator$"
  }, 
  run = run 
}

end
